[
  {
    "title": "Electoral Bonds Violate Citizens' Right To Information, Promotes Corruption: Prashant Bhushan To Supreme Court [Day 1]",
    "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5saXZlbGF3LmluL3RvcC1zdG9yaWVzL2VsZWN0b3JhbC1ib25kcy12aW9sYXRlLWNpdGl6ZW5zLXJpZ2h0LXRvLWluZm9ybWF0aW9uLXByb21vdGVzLWNvcnJ1cHRpb24tcHJhc2hhbnQtYmh1c2hhbi10by1zdXByZW1lLWNvdXJ0LWRheS0xLTI0MTMxN9IBnwFodHRwczovL3d3dy5saXZlbGF3LmluL2FtcC90b3Atc3Rvcmllcy9lbGVjdG9yYWwtYm9uZHMtdmlvbGF0ZS1jaXRpemVucy1yaWdodC10by1pbmZvcm1hdGlvbi1wcm9tb3Rlcy1jb3JydXB0aW9uLXByYXNoYW50LWJodXNoYW4tdG8tc3VwcmVtZS1jb3VydC1kYXktMS0yNDEzMTc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The ruling Bharatiya Janata Party ( BJP) is in power at the center of Indian politics for the first time in more than a decade, and that could change if the country's Supreme Court rules in its favor. The court is hearing a challenge to a 2016 election law that allows the BJP and other parties to collect money from voters via \"electoral bonds,\" reports the Wall Street Journal. The bonds are supposed to be used to fund the party's campaign, but critics say they're being used to buy votes and influence elections. A lawyer for the opposition Congress Party has argued that most of the electoral bonds go to the BJP, while only around 1% go to other parties, reports the Times of India. The ruling party, however, says most of the electoral bonds go to state governments, not the opposition. If the court sides with the BJP, it could have a huge impact on how elections are held in the country.",
    "img_url": "https://certify.alexametrics.com/atrk.gif?account=ZwgTs1kx0820/9"
  },
  {
    "title": "Policeman gunned down in Jammu and Kashmir's Baramulla, 3rd targeted terrorist attack in three days",
    "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy9pbmRpYS9wb2xpY2VtYW4tZ3VubmVkLWRvd24taW4tamFtbXUtYW5kLWthc2htaXJzLWJhcmFtdWxsYS0zcmQtdGFyZ2V0ZWQtdGVycm9yaXN0LWF0dGFjay1pbi10aHJlZS1kYXlzLTExNjk4NzczOTM1NDczLmh0bWzSAZ0BaHR0cHM6Ly93d3cubGl2ZW1pbnQuY29tL25ld3MvaW5kaWEvcG9saWNlbWFuLWd1bm5lZC1kb3duLWluLWphbW11LWFuZC1rYXNobWlycy1iYXJhbXVsbGEtM3JkLXRhcmdldGVkLXRlcnJvcmlzdC1hdHRhY2staW4tdGhyZWUtZGF5cy9hbXAtMTE2OTg3NzM5MzU0NzMuaHRtbA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "A police officer was shot dead outside his home in Kashmir on Tuesday by unknown gunmen, police say. The incident took place in the Kralpora area of Kashmir's Baramulla district, the Times of India reports. \"Head Constable Ghulam Mohammad Dar was shot outside his house,\" a police rep says. \"He was rushed to a nearby hospital, where he died of his injuries.\" No group has claimed responsibility for the attack.",
    "img_url": "https://www.livemint.com/lm-img/static/static/1x1_img.gif"
  },
  {
    "title": "Manipur Police Commandos, Sent As Reinforcements After Cop Was Shot, Ambushed",
    "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5uZHR2LmNvbS9pbmRpYS1uZXdzL21hbmlwdXItcG9saWNlLWNvbW1hbmRvcy1zZW50LWFzLXJlaW5mb3JjZW1lbnRzLXRvLW1vcmVoLWFtYnVzaGVkLWJ5LXN1c3BlY3RlZC1pbnN1cmdlbnRzLTQ1MzIyNzTSAQA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "Suspected militants in India's Manipur state ambushed a team of police commandos today as they were on their way to a border town to investigate the killing of a senior police officer, reports the Times of India. At least seven of the commandos were injured in the attack, and government sources say troops from Assam Rifles rushed to the scene and rescued the men, who were taken to a local hospital.",
    "img_url": "https://c.ndtvimg.com/2023-10/80obj9ds_manipur-cop-1200_625x300_31_October_23.jpg"
  },
  {
    "title": "Dozens reported killed in explosion in northern Gaza refugee camp",
    "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vd29ybGQtbmV3cy9pc3JhZWxoYW1hcy13YXItZG96ZW5zLXJlcG9ydGVkLWtpbGxlZC1pbi1leHBsb3Npb24taW4tbm9ydGhlcm4tZ2F6YS1yZWZ1Z2VlLWNhbXAtMTAxNjk4NzY4NTY4NjIyLmh0bWzSAZQBaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL3dvcmxkLW5ld3MvaXNyYWVsaGFtYXMtd2FyLWRvemVucy1yZXBvcnRlZC1raWxsZWQtaW4tZXhwbG9zaW9uLWluLW5vcnRoZXJuLWdhemEtcmVmdWdlZS1jYW1wLTEwMTY5ODc2ODU2ODYyMi1hbXAuaHRtbA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "An explosion at a crowded Palestinian refugee camp in the Gaza Strip killed at least 47 people today, the AP reports. According to the AFP, footage from the scene showed at least 47 bodies recovered from the rubble. Located north of Gaza City, the Jabalia refugee camp is the largest of Gaza's eight refugee camps with over 116,000 Palestinian refugees registered there by the UN as of July 2023. Refugees began relocating to the camp in 2005.",
    "img_url": "https://www.hindustantimes.com/static-content/1y/ht/hamburger-i.png"
  },
  {
    "title": "‘Destruction of Democracy’: Opposition Leaders Slam Modi Govt as Apple Flags ‘State-Sponsored Attack'",
    "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vdGhld2lyZS5pbi9wb2xpdGljcy9kZXN0cnVjdGlvbi1kZW1vY3JhY3ktb3Bwb3NpdGlvbi1sZWFkZXJzLXNsYW0tbW9kaS1nb3Z0LXNweXdhcmUtYXR0YWNr0gFwaHR0cHM6Ly9tLnRoZXdpcmUuaW4vYXJ0aWNsZS9wb2xpdGljcy9kZXN0cnVjdGlvbi1kZW1vY3JhY3ktb3Bwb3NpdGlvbi1sZWFkZXJzLXNsYW0tbW9kaS1nb3Z0LXNweXdhcmUtYXR0YWNrL2FtcA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "Opposition leaders in India are accusing the government of spying on them after Apple warned that hackers may have been targeting politicians and journalists with spyware. The Communist Party of India's Sitaram Yechury, who was one of the politicians who received the warning about a state-sponsored spyware attack, wrote to Prime Minister Narendra Modi to register his protest, the Times of India reports. \"The government should be held responsible for failing to check, and possibly even conspiring to aid, apparent cases of spyware being used against political leaders, senior journalists, and policy influencers,\" he wrote. \"This constitutes a clear violation of the fundamental rights of citizens,\" Yechury said. Apple warned that hackers may have been targeting leaders of the opposition Bharatiya Janata Party as well as senior journalists. The company said it had found evidence of \"state-sponsored attackers\" targeting the phones of more than a dozen politicians and journalists, though it didn't name names. The government hasn't commented.",
    "img_url": "https://www.facebook.com/tr?id=1031643143533563&ev=PageView&noscript=1"
  },
  {
    "title": "Hamas Vows To Turn \"Gaza Into Graveyard For Israel's Military\"",
    "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5kdHYuY29tL3dvcmxkLW5ld3MvaXNyYWVsLWhhbWFzLXdhci1nYXphLWhhbWFzLXdpbGwtZnJlZS1zb21lLWZvcmVpZ24taG9zdGFnZXMtaW4tbmV4dC1mZXctZGF5cy00NTMzMTY20gF6aHR0cHM6Ly93d3cubmR0di5jb20vd29ybGQtbmV3cy9pc3JhZWwtaGFtYXMtd2FyLWdhemEtaGFtYXMtd2lsbC1mcmVlLXNvbWUtZm9yZWlnbi1ob3N0YWdlcy1pbi1uZXh0LWZldy1kYXlzLTQ1MzMxNjYvYW1wLzE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "Hamas says it will release some of the foreign hostages it has been holding in Gaza over the next few days. \"We have informed intermediaries that we will release a certain number of foreigners in the next few days,\" a spokesman for the Ezzedine Al-Qassam Brigades, Hamas' armed wing, said in a televised address. Around 240 hostages are believed to be held by Hamas at the moment in Gaza, after the group attacked communities across southern Israel on October 7.",
    "img_url": "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/968076326/?guid=ON&script=0"
  },
  {
    "title": "Why TMC is silent on Mahua Moitra as she faces parliamentary probe",
    "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY2l0aWVzL2tvbGthdGEtbmV3cy93aHktdG1jLWlzLXNpbGVudC1vbi1tYWh1YS1tb2l0cmEtYXMtc2hlLWZhY2VzLXBhcmxpYW1lbnRhcnktcHJvYmUtMTAxNjk4NzM5NTY5NzgyLmh0bWzSAY4BaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL2NpdGllcy9rb2xrYXRhLW5ld3Mvd2h5LXRtYy1pcy1zaWxlbnQtb24tbWFodWEtbW9pdHJhLWFzLXNoZS1mYWNlcy1wYXJsaWFtZW50YXJ5LXByb2JlLTEwMTY5ODczOTU2OTc4Mi1hbXAuaHRtbA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "A member of India's lower house of parliament has been arrested in connection with an alleged bribery case, the Times of India reports. According to the Indian Express, BJP lawmaker Nishikant Dubey says he was approached by a businessman who wanted him to pay a bribe to a member of West Bengal's ruling Trinamool Congress party, Mahua Moitra. Dubey says Moitra, who is also a member of the lower house, offered him about $1 million in exchange for his vote in favor of a bill to allow foreign investment in West Bengal's ports. According to the Times of India, Moitra's husband was also present at the meeting in which the businessman allegedly offered the bribe. According to the Indian Express, Moitra's arrest was announced by Prime Minister Narendra Modi's government on Tuesday.",
    "img_url": "https://www.hindustantimes.com/static-content/1y/ht/hamburger-i.png"
  },
  {
    "title": "Telangana Congress launches 'Kalleshwaram ATM' campaign against BRS govt",
    "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vZWxlY3Rpb25zL3RlbGFuZ2FuYS1lbGVjdGlvbnMvdGVsYW5nYW5hLWNvbmdyZXNzLWxhdW5jaGVzLWthbGxlc2h3YXJhbS1hdG0tY2FtcGFpZ24tYWdhaW5zdC1icnMtZ292dC0xMjMxMDMxMDA4ODhfMS5odG1s0gGeAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvZWxlY3Rpb25zL3RlbGFuZ2FuYS1lbGVjdGlvbnMvdGVsYW5nYW5hLWNvbmdyZXNzLWxhdW5jaGVzLWthbGxlc2h3YXJhbS1hdG0tY2FtcGFpZ24tYWdhaW5zdC1icnMtZ292dC0xMjMxMDMxMDA4ODhfMS5odG1s?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The youth branch of the Indian Congress Party is taking a stand against corruption in the southern state of Telangana. To that end, the party's president in the state, Balu Naik, has installed a mock ATM machine and branded it \"Kalleshwaram ATM,\" alleging that the Bharat Rashtra Samithi (BRS) government has done corruption in the project, the Deccan Chronicle reports. The Congress also came up with a new slogan: \"Kalleshwaram Corruption Rao.\" Naik's protest took place near a huge idol of Lord Ganesh.",
    "img_url": "https://www.business-standard.com/assets/web-assets/images/bs-logowithtagline-min.png"
  },
  {
    "title": "Rajasthan elections: Congress releases fourth list of 56 candidates, Gourav Vallabh from Udaipur | Full list",
    "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vZWxlY3Rpb25zL3JhamFzdGhhbi1hc3NlbWJseS1lbGVjdGlvbi9yYWphc3RoYW4tZWxlY3Rpb25zLWNvbmdyZXNzLXJlbGVhc2VzLWZvdXJ0aC1saXN0LW9mLTU2LWNhbmRpZGF0ZXMtZnVsbC1saXN0LTEwMTY5ODc2MjI3NzI5MS5odG1s0gGqAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9lbGVjdGlvbnMvcmFqYXN0aGFuLWFzc2VtYmx5LWVsZWN0aW9uL3JhamFzdGhhbi1lbGVjdGlvbnMtY29uZ3Jlc3MtcmVsZWFzZXMtZm91cnRoLWxpc3Qtb2YtNTYtY2FuZGlkYXRlcy1mdWxsLWxpc3QtMTAxNjk4NzYyMjc3MjkxLWFtcC5odG1s?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The ruling Bharatiya Janata Party ( BJP) and the opposition Congress Party ( Congress) are locked in a neck-and-neck race ahead of the by-elections in the Indian state of Rajasthan on Nov. 25. The by-elections are for the state's 140-member assembly, and the Congress, which has been in power in Rajasthan for the past decade, is trying to win it back for the fourth time. The by-elections are seen as a test for the popularity of Prime Minister Narendra Modi, who has been leading the BJP since 2009. The by-elections are seen as a test for the popularity of Modi, who has been leading the BJP since 2009.",
    "img_url": "https://www.hindustantimes.com/static-content/1y/ht/hamburger-i.png"
  },
  {
    "title": "IMD predicts warmer November amid intensifying El Nino conditions",
    "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vaW5kaWEtbmV3cy9pbWQtcHJlZGljdHMtd2FybWVyLW5vdmVtYmVyLWFtaWQtaW50ZW5zaWZ5aW5nLWVsLW5pbm8tY29uZGl0aW9ucy0xMDE2OTg3NTI3NzUxMzEuaHRtbNIBhAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vaW5kaWEtbmV3cy9pbWQtcHJlZGljdHMtd2FybWVyLW5vdmVtYmVyLWFtaWQtaW50ZW5zaWZ5aW5nLWVsLW5pbm8tY29uZGl0aW9ucy0xMDE2OTg3NTI3NzUxMzEtYW1wLmh0bWw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "El Nino is taking a heavy toll on India, which is expecting above-normal minimum temperatures in most parts of the country in November, the Hindustan Times reports. According to the India Meteorological Department, 77% of the country as a whole is likely to see normal rainfall in November, while temperatures are expected to be above-normal in most parts of the country, barring some areas in the northwest and west-central regions.",
    "img_url": "https://www.hindustantimes.com/static-content/1y/ht/hamburger-i.png"
  },
  {
    "title": "Israel-Hamas war LIVE: Blinken to visit Israel, other countries in region, State Department confirms",
    "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lndpb25ld3MuY29tL3dvcmxkL2lzcmFlbC1oYW1hcy13YXItbGl2ZS1pc3JhZWwtYXJteS1zYXlzLXJlZnVnZWUtY2FtcC1ib21iZWQtdG8ta2lsbC10b3AtaGFtYXMtY29tbWFuZGVyLTY1MzY0NdIBf2h0dHBzOi8vd3d3Lndpb25ld3MuY29tL3dvcmxkL2lzcmFlbC1oYW1hcy13YXItbGl2ZS1pc3JhZWwtYXJteS1zYXlzLXJlZnVnZWUtY2FtcC1ib21iZWQtdG8ta2lsbC10b3AtaGFtYXMtY29tbWFuZGVyLTY1MzY0NS9hbXA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The State Department says \"real progress\" has been made in negotiations to allow US citizens and other foreigners to leave the Gaza Strip. \"While I can't make an announcement today, we do think we've made very real progress on this, as I said in just the past few hours,\" spokesman Matthew Miller told reporters, according to al-Jazeera. The State Department has been working with Qataris and Egyptians to open the Rafah border crossing into Egypt to allow Americans and other foreigners to leave Gaza, which has been under an Israeli blockade since 2007.",
    "img_url": "https://cdn.wionews.com/images/2022/UGC_Banner_600x50.png?imwidth=1200"
  },
  {
    "title": "Israel-Hamas War: PM Netanyahu reacts to India’s stand on UN resolution",
    "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS92aWRlb3MvbmV3cy9pc3JhZWwtaGFtYXMtd2FyLXBtLW5ldGFueWFodS1yZWFjdHMtdG8taW5kaWFzLXN0YW5kLW9uLXVuLXJlc29sdXRpb24vdmlkZW9zaG93LzEwNDg1NDExOS5jbXPSAZEBaHR0cHM6Ly90aW1lc29maW5kaWEuaW5kaWF0aW1lcy5jb20vdmlkZW9zL25ld3MvaXNyYWVsLWhhbWFzLXdhci1wbS1uZXRhbnlhaHUtcmVhY3RzLXRvLWluZGlhcy1zdGFuZC1vbi11bi1yZXNvbHV0aW9uL2FtcF92aWRlb3Nob3cvMTA0ODU0MTE5LmNtcw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The UN General Assembly on Thursday unanimously approved a resolution calling for a \"humanitarian ceasefire\" between Israel and Hamas in the wake of the latest fighting, the AP reports. India was one of the countries to abstain from voting on the resolution, which was backed by 120 members in favor, 14 against, and 45 abstentions. India's foreign minister said his country would not have voted for the resolution if it hadn't been for \"Israel's right to self-defense and the right of its citizens to self-defense.\" Israeli Prime Minister Benjamin Netanyahu slammed the resolution as \"deeply flawed\" and said that \"no civilized country, including India, would tolerate the events that transpired in Israel,\" the Times of India reports. The resolution calls for a humanitarian ceasefire, the protection of civilians, and upholding legal and humanitarian obligations.",
    "img_url": "https://static.toiimg.com/thumb/imgsize-,msid-104680684,width-200,resizemode-4/104680684.jpg"
  },
  {
    "title": "Hamas Fighters Rush Out Of Tunnels, Attack Israeli Ground Forces As They Invade Gaza | Watch",
    "url": "https://news.google.com/rss/articles/CCAiC2s4QnNIazBLUTFrmAEB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "It's that time of the year again, when we take a look back at some of the best movies and TV shows of the last quarter-century. Here's a look at some of the more notable winners and losers of the Golden Globes, as voted on by the Academy of Motion Picture Arts and Sciences: ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ;",
    "img_url": "https://i.ytimg.com/vi/k8BsHk0KQ1k/maxresdefault.jpg"
  },
  {
    "title": "Indian Navy chief offers to run warship training hub for regional states",
    "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vaW5kaWEtbmV3cy9pbmRpYW4tbmF2eS1jaGllZi1vZmZlcnMtdG8tcnVuLXdhcnNoaXAtdHJhaW5pbmctaHViLWZvci1yZWdpb25hbC1zdGF0ZXMtMTIzMTAzMTAxMjM1XzEuaHRtbNIBjQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL2luZGlhLW5ld3MvaW5kaWFuLW5hdnktY2hpZWYtb2ZmZXJzLXRvLXJ1bi13YXJzaGlwLXRyYWluaW5nLWh1Yi1mb3ItcmVnaW9uYWwtc3RhdGVzLTEyMzEwMzEwMTIzNV8xLmh0bWw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The chief of India's Navy on Tuesday laid out four principles that he says would guide the country's relations with other countries in the Indian Ocean region, the Guardian reports. According to the Times of India, Admiral Hari Kumar says the principles are: \"structure light, but functionally heavy\"—a reference to the concept of a \"cooperative maritime security framework\"—\"based on common maritime priorities\" (CMPs) \"to ensure safety and security of shipping in the IOR\" \"to promote free movement of people and goods\" \"to promote development of ports in the IOR\" \"to promote free movement of people and goods\"",
    "img_url": "https://www.business-standard.com/assets/web-assets/images/bs-logowithtagline-min.png"
  },
  {
    "title": "Top Nifty gainers and losers: HDFC Life, Asian Paints rise, Sun Pharma, Eicher fall",
    "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvcGhvdG9zL2J1c2luZXNzL21hcmtldHMvdG9wLW5pZnR5LWdhaW5lcnMtYW5kLWxvc2Vycy1hdC1taWQtZGF5LWhkZmMtbGlmZS1hc2lhbi1wYWludHMtcmlzZS1zdW4tcGhhcm1hLWVpY2hlci1mYWxsLTExNjMwNzkxLmh0bWzSAaYBaHR0cHM6Ly93d3cubW9uZXljb250cm9sLmNvbS9uZXdzL3Bob3Rvcy9idXNpbmVzcy9tYXJrZXRzL3RvcC1uaWZ0eS1nYWluZXJzLWFuZC1sb3NlcnMtYXQtbWlkLWRheS1oZGZjLWxpZmUtYXNpYW4tcGFpbnRzLXJpc2Utc3VuLXBoYXJtYS1laWNoZXItZmFsbC0xMTYzMDc5MS5odG1sL2FtcA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The Indian stock market's main index, the Bombay Stock Exchange's S&P CNX Nifty, dropped below the 20,000 mark for the first time in nearly a year on Wednesday as investors booked profits following two days of gains, reports the Economic Times. The S&P CNX Nifty fell 61 points, or 0.3%, to 19,079 at the close. The Indian benchmark indices snapped two-day gaining momentum and ended lower in a volatile session on October 31, with the Nifty below 19,100 amid selling across the sectors, barring realty.",
    "img_url": "https://images.moneycontrol.com/images/common/headfoot/cb_chart_1010_244x115.png"
  },
  {
    "title": "RBI: Q2 GDP number will surprise everyone on the upside: RBI chief",
    "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9idXNpbmVzcy9pbmRpYS1idXNpbmVzcy9xMi1nZHAtbnVtYmVyLXdpbGwtc3VycHJpc2UtZXZlcnlvbmUtb24tdGhlLXVwc2lkZS1yYmktY2hpZWYvYXJ0aWNsZXNob3cvMTA0ODU4ODE1LmNtc9IBjQFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9idXNpbmVzcy9pbmRpYS1idXNpbmVzcy9xMi1nZHAtbnVtYmVyLXdpbGwtc3VycHJpc2UtZXZlcnlvbmUtb24tdGhlLXVwc2lkZS1yYmktY2hpZWYvYW1wX2FydGljbGVzaG93LzEwNDg1ODgxNS5jbXM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "India's economy grew at a slower-than-expected 7.4% in the second quarter of this year. That's down from 8.8% in the first quarter and well below the Reserve Bank of India's guidance of 9% to 10%, the Wall Street Journal reports. The government also revised the first quarter's growth downward to 5.3%. The central bank is expecting growth to accelerate to 8% in the third quarter. \"India is better placed to deal with potentially risky situations,\" the central bank's governor said, per the Times of India, adding that \"geopolitical uncertainty is the biggest risk to global growth and India is better placed to deal with potentially risky situations.\" India's retail inflation in July jumped to 7.44% from 4.87% in June, the government said Tuesday.",
    "img_url": "https://static.toiimg.com/photo/91617514.cms"
  },
  {
    "title": "Cello World IPO fully booked on day 2, subscribed 1.44 times; NIIs steal the show",
    "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5saXZlbWludC5jb20vbWFya2V0L2lwby9jZWxsby13b3JsZC1pcG8tZnVsbHktYm9va2VkLW9uLWRheS0yLXN1YnNjcmliZWQtMS0yMS10aW1lcy1zby1mYXItbmlpcy1zdGVhbC10aGUtc2hvdy0xMTY5ODc0ODYxMDI2OC5odG1s0gGSAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tYXJrZXQvaXBvL2NlbGxvLXdvcmxkLWlwby1mdWxseS1ib29rZWQtb24tZGF5LTItc3Vic2NyaWJlZC0xLTIxLXRpbWVzLXNvLWZhci1uaWlzLXN0ZWFsLXRoZS1zaG93L2FtcC0xMTY5ODc0ODYxMDI2OC5odG1s?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The stock market opened on a positive note for Cello World on Tuesday, with the company's much-anticipated initial public offering pricing at the low end of the indicative price range of <unk>617 to <unk>648 per share, the Wall Street Journal reports. The offering is expected to raise around <unk>100 million, per the company's plan to list on the London Stock Exchange.",
    "img_url": "https://www.livemint.com/lm-img/static/static/1x1_img.gif"
  },
  {
    "title": "Stocks to Watch: Marico, TVS Motor, Castrol India, UPL",
    "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL21hcmtldC9zdG9ja3MtdG8td2F0Y2gtbWFyaWNvLXR2cy1tb3Rvci1jYXN0cm9sLWluZGlhLXVwbC0zMjkxOTM1L9IBaGh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL21hcmtldC9zdG9ja3MtdG8td2F0Y2gtbWFyaWNvLXR2cy1tb3Rvci1jYXN0cm9sLWluZGlhLXVwbC0zMjkxOTM1L2xpdGUv?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "The Indian stock market opened on a positive note Tuesday, with the benchmark index rising for a third straight day. The Bombay Stock Exchange's Sensitive Index, or Sensex, opened at 64,115 and was trading at 64,126 as of this writing, up 322 points, or 0.52%. The National Stock Exchange's Nifty 50 index, however, opened at 19,222 and was down 3.5 points, or 0.02%, at 19,222 as of this writing, MarketWatch reports. \"The domestic market mirrored the upbeat European & Asian markets, as geopolitical risk in West Asia continues,\" an analyst says. \" Equities are experiencing a short-term bounce after the heavy selling last week, as crude moderates and Q2 results provide some relief.\"",
    "img_url": "https://data.indianexpress.com/election2019/track_1x1.jpg"
  },
  {
    "title": "Mobile menu",
    "url": "https://news.google.com/rss/articles/CBMirQFodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuaW4vdGVjaC9uZXdzL3JpcC10b3VjaC1iYXItYXBwbGUtaXMtZ2V0dGluZy1yaWQtb2YtbWFjYm9va3Mtd2l0aC10aGUtY29udHJvdmVyc2lhbC10b3VjaC1zY3JlZW4tYXQtdGhlLXRvcC1vZi1rZXlib2FyZHMvYXJ0aWNsZXNob3cvMTA0ODY4MDc5LmNtc9IBAA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "It's that time of the year again, when we take a look back at some of the best movies and TV shows of the last quarter-century. Here's a look at some of the more notable winners and losers of the Golden Globes, as voted on by the Academy of Motion Picture Arts and Sciences: ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ;",
    "img_url": "data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%2715%27%20height=%2712%27/%3e"
  },
  {
    "title": "Amazon Festival Sale 2023: Save over 20% on budget-friendly water heaters",
    "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5saXZlbWludC5jb20vdGVjaG5vbG9neS9nYWRnZXRzL2FtYXpvbi1mZXN0aXZhbC1zYWxlLTIwMjMtc2F2ZS1vdmVyLTIwLW9uLWJ1ZGdldC1mcmllbmRseS13YXRlci1oZWF0ZXJzLTExNjk4NzQ0MjkxODUwLmh0bWzSAYsBaHR0cHM6Ly93d3cubGl2ZW1pbnQuY29tL3RlY2hub2xvZ3kvZ2FkZ2V0cy9hbWF6b24tZmVzdGl2YWwtc2FsZS0yMDIzLXNhdmUtb3Zlci0yMC1vbi1idWRnZXQtZnJpZW5kbHktd2F0ZXItaGVhdGVycy9hbXAtMTE2OTg3NDQyOTE4NTAuaHRtbA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "If you're in the market for a new water heater, now's the time. There's a deal going on at the Amazon Festival Sale 2023, and it's a good one to grab before it's too late. CNET reports that you can get a top-of-the-line Siemens water heater for the low, low price of just $99. That's a savings of more than 50% over the regular price, and it comes with a year's supply of hot water, according to a press release.",
    "img_url": "https://www.livemint.com/lm-img/img/2023/10/31/1600x900/water_heaters_1698745215517_1698745237834.jpg"
  },
  {
    "title": "Windows 11 has native support for multiple compression formats",
    "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmdpemNoaW5hLmNvbS8yMDIzLzEwLzMxL3dpbmRvd3MtMTEtbmF0aXZlLWNvbXByZXNzaW9uLXN1cHBvcnQv0gFOaHR0cHM6Ly93d3cuZ2l6Y2hpbmEuY29tLzIwMjMvMTAvMzEvd2luZG93cy0xMS1uYXRpdmUtY29tcHJlc3Npb24tc3VwcG9ydC9hbXAv?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "Windows 11 will include native support for multiple formats, including 7-Zip and RAR, meaning users will no longer have to rely on the standard Windows zip utility to compress files. \"This development implies that users will no longer have to rely on additional tools or the standard Windows zip utility to compress files,\" says a Microsoft blog post. \"During the Build developer conference, Microsoft shared its strategy to offer compatibility with a wide range of archive formats, including tar, gz, and others. This enhancement meets a persistent request from the Windows user base.\"",
    "img_url": "https://secure.gravatar.com/avatar/da1f6dbd16c40922d2194091f850f124?s=16&d=mm&r=g"
  },
  {
    "title": "Apple shows off MacBooks with M3 chip at Scary Fast event",
    "url": "https://news.google.com/rss/articles/CCAiCy11OEpZRWEyUlZzmAEB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "It's that time of the year again, when we take a look back at some of the best movies and TV shows of the last quarter-century. Here's a look at some of the more notable winners and losers of the Golden Globes, as voted on by the Academy of Motion Picture Arts and Sciences: ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ;",
    "img_url": "https://i.ytimg.com/vi/-u8JYEa2RVs/maxresdefault.jpg"
  },
  {
    "title": "Deepika Padukone, Alia Bhatt, Katrina Kaif, Malaika Arora: Celebs arrive in style at Jio World Plaza launch",
    "url": "https://news.google.com/rss/articles/CBMivwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9lbnRlcnRhaW5tZW50L2hpbmRpL2JvbGx5d29vZC9uZXdzL2RlZXBpa2EtcGFkdWtvbmUtYWxpYS1iaGF0dC1rYXRyaW5hLWthaWYtbWFsYWlrYS1hcm9yYS1jZWxlYnMtYXJyaXZlLWluLXN0eWxlLWF0LWppby13b3JsZC1wbGF6YS1sYXVuY2gvYXJ0aWNsZXNob3cvMTA0ODY0ODA1LmNtc9IBwwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9lbnRlcnRhaW5tZW50L2hpbmRpL2JvbGx5d29vZC9uZXdzL2RlZXBpa2EtcGFkdWtvbmUtYWxpYS1iaGF0dC1rYXRyaW5hLWthaWYtbWFsYWlrYS1hcm9yYS1jZWxlYnMtYXJyaXZlLWluLXN0eWxlLWF0LWppby13b3JsZC1wbGF6YS1sYXVuY2gvYW1wX2FydGljbGVzaG93LzEwNDg2NDgwNS5jbXM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "Amitabh Bachchan, one of India's most beloved movie stars, has died at the age of 69 after a long battle with cancer, the Times of India reports. The actor was admitted to a hospital in Mumbai on Saturday. He had been diagnosed with leiomyosarcoma, a rare form of cancer, in 2006. He had reportedly been in declining health since then. Bachchan, who was last seen in 2010's Bodyguard, was cremated at his father's crematorium in the town of Dadri on Sunday. His body was then taken to the Taj Mahal, where it was lit on Tuesday. Bachchan was cremated with his family by his side.",
    "img_url": "https://www.facebook.com/tr?id=593671331875494&ev=PageView&noscript=1"
  },
  {
    "title": "Matthew Perry Was \"Doing Really Well\" Before Death, Says Pickleball Coach",
    "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3Lm5kdHYuY29tL3dvcmxkLW5ld3MvbWF0dGhldy1wZXJyeS13YXMtZG9pbmctcmVhbGx5LXdlbGwtYmVmb3JlLWRlYXRoLXNheXMtcGlja2xlYmFsbC1jb2FjaC00NTMxNDk50gF0aHR0cHM6Ly93d3cubmR0di5jb20vd29ybGQtbmV3cy9tYXR0aGV3LXBlcnJ5LXdhcy1kb2luZy1yZWFsbHktd2VsbC1iZWZvcmUtZGVhdGgtc2F5cy1waWNrbGViYWxsLWNvYWNoLTQ1MzE0OTkvYW1wLzE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "Matthew Perry was \"doing really well\" before his death in a hot tub, according to his coach. Matt Manasse, who trains Perry as a competitive runner, tells People that the Friends star was \"doing really well\" just a few weeks before his death in a hot tub at his LA rehab center. He was also \"helping others who were staying at the rehabilitation center he had established,\" Manasse says. Perry set up the center to help people with alcohol and drug addiction, People reports.",
    "img_url": "https://c.ndtvimg.com/2023-10/litiqvog_matthew-perry_625x300_31_October_23.jpeg"
  },
  {
    "title": "Varun Tej, Lavanya Tripathi twin in yellow for Haldi ceremony; Chiranjeevi also spotted. See pics",
    "url": "https://news.google.com/rss/articles/CBMirgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vZW50ZXJ0YWlubWVudC90ZWx1Z3UtY2luZW1hL3ZhcnVuLXRlai1sYXZhbnlhLXRyaXBhdGhpLXR3aW4taW4teWVsbG93LWZvci1oYWxkaS1jZXJlbW9ueS1jaGlyYW5qZWV2aS1hbHNvLXNwb3R0ZWQtc2VlLXBpY3MtMTAxNjk4NjgyOTM3Mzg2Lmh0bWzSAbIBaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL2VudGVydGFpbm1lbnQvdGVsdWd1LWNpbmVtYS92YXJ1bi10ZWotbGF2YW55YS10cmlwYXRoaS10d2luLWluLXllbGxvdy1mb3ItaGFsZGktY2VyZW1vbnktY2hpcmFuamVldmktYWxzby1zcG90dGVkLXNlZS1waWNzLTEwMTY5ODY4MjkzNzM4Ni1hbXAuaHRtbA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "summary": "Actor Varun Tej and actress Lavanya Tripathi are getting married in Tuscany, Italy, on Nov. 1, and they've already kicked off their wedding festivities by posting pictures from their Haldi ceremony on Instagram. The event, which was attended by close friends and family members, was held in the couple's hometown of Hyderabad and included a traditional Haldi ceremony and a reception in the couple's hometown of Hyderabad, the Times of India reports.",
    "img_url": "https://images.hindustantimes.com/default/550x309.jpg"
  }
]